development/projects/vanilla/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<title>Vanilla | Simon Dobson</title>
<link rel="icon" href="../../../images/favicon.png" sizes="16x16">
<link rel="alternate" type="application/rss+xml" href="../../../rss.xml">
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Droid+Sans+Mono%7CLibre+Baskerville%7CMontserrat%7CPlayfair+Display%7CTangerine">
<link rel="stylesheet" href="../../../assets/css/libretto_styles.css">
<link rel="stylesheet" href="../../../assets/css/baguetteBox.min.css">
<link rel="stylesheet" href="../../../assets/css/code.css">
<link rel="stylesheet" href="../../../assets/css/nikola_rst.css">
<link rel="stylesheet" href="../../../assets/css/nikola_ipython.css">
<link rel="stylesheet" href="https://use.fontawesome.com/releases/v5.0.13/css/all.css" integrity="sha384-DNOHZ68U8hZfKXOrtjWvjxusGo9WQnrNx2sqG0tfsghAvtVlRW3tvkXWZh58N9jp" crossorigin="anonymous">
</head>
<body>
    <!-- Navigation bar -->
    <header class="nav-bar"><div class="site-branding">
	    <h1 class="site-title">
		<a href="https://simondobson.org/" title="Simon Dobson" rel="home">Simon&nbsp;Dobson</a>
	    </h1>
	</div>
	<nav class="site-navigation" role="navigation"><div class="menu-toggle">
		<span class="mobile-site-title">Simon Dobson</span>
	    </div>
	    <ul class="menu">
<li><a href="../../../index.html">Home</a></li>
		    <li><a href="../../../personal/">About&nbsp;me</a></li>
		    <li><a href="../../../research/">Research</a></li>
		    <li><a href="../">Software</a></li>
		    <li><a href="../../../writing/">Writing</a></li>
		    <li><a href="../../../personal/contact/">Contact</a></li>
		<li>
<a href="../../../rss.xml"><i class="fa fa-rss"></i></a>
	    </li>
</ul></nav></header><!-- Page Header --><div class="title-block post-format-icon-pin">
	<h1>Vanilla</h1>
    </div>

	<!-- Page Content -->
    <div class="site-content" role="main">
	<article class="format-standard libretto-long-form"><div class="entry-content">
		<div id="outline-container-org7d1bf25" class="outline-2">
<h2 id="org7d1bf25">Vanilla</h2>
<div class="outline-text-2" id="text-org7d1bf25">
<p>
The Vanilla project was an experiment in language design, intended to
test two&nbsp;hypotheses:
</p>

<ol class="org-ol">
<li>To what extent are programming languages composed of independent
sub-features that can themselves be independently described and
composed?,&nbsp;and,</li>
<li>If this is so to a large extent, is it possible to build effective
language tools (specifically interpreters) from such
independently-compiled&nbsp;features?</li>
</ol>
<p>
The answer to the first question is a qualified “yes”: a programming
language is, to a large extent, composed of features that are either
independent of other features or interact with them in modular
ways. An if statement, for example, depends on there being a `Boolean`
type in the language, but is independent of the types and expressions
that appear in its two arms. This suggests that we should be able to
define the typing and semantic rules of if statements independently of
almost all other language&nbsp;features.
</p>

<p>
In developing Vanilla we developed a modular, composable type-checking
and interpretation framework within which to define language features
and their associated rules. We then developed a large range of
language features within the framework, including most of the
machinery needed to build imperative, object-oriented and (strict)
functional&nbsp;languages.
</p>

<p>
The main disadvantage of Vanilla is that it uses Java, both as a
run-time host language and for expressing the rules and
structures. The code that designers have to write is extremely
stylised and repetitive. It would be better to have a more powerful
language for describing languages, and also to allow rule-based&nbsp;expressions.
</p>
</div>

<div id="outline-container-org0120978" class="outline-3">
<h3 id="org0120978">Publications</h3>
<div class="outline-text-3" id="text-org0120978">
<p>
<a id="org6661369"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/vanilla-microsoft-2000.ppt">Building Programming Languages from Components</a></i>. 2000. Invited talk to the Microsoft Research&nbsp;Institute.
</p>

<p>
<a id="org4cfec9e"></a>Linda Farragher and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/TCD-CS-2000-22.pdf">Java Decaffeinated: Experiences Building a Programming Language from Components</a></i>. Technical report <span class="caps">TCD</span>-<span class="caps">CS</span>-2000-22. Department of Computer Science, Trinity College Dublin.&nbsp;2000.
</p>

<p>
<a id="org635a2e5"></a>Paddy Nixon, Vinny Wade, Simon Dobson, John Fuller, and Sotirios Terzis.  <i><a href="https://simondobson.org/softcopy/virtues-ocve-1998.pdf">Designing Components for a Virtual Organisation: A Case Study</a></i>. In <i>Proceedings of Objects, Components and the Virtual Enterprise</i>. Vancouver, ca.&nbsp;1998.
</p>

<p>
<a id="orgc690bcf"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/TCD-CS-1998-20.ps">A First Taste of Vanilla</a></i>. Technical report <span class="caps">TCD</span>-<span class="caps">CS</span>-1998-20. Department of Computer Science, Trinity College Dublin.&nbsp;1998.
</p>

<p>
<a id="org016fd9b"></a>Simon Dobson.  <i>The O2 Programming Language</i>. Department of Computer Science, Trinity College Dublin. 1998. Reference manual for the Vanilla implementation of Abadí and Cardelli’s O2&nbsp;language.
</p>

<p>
<a id="orgc03d4a7"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/TCD-CS-1998-19.ps">Modular Parsers</a></i>. Technical report <span class="caps">TCD</span>-<span class="caps">CS</span>-1998-19. Department of Computer Science, Trinity College Dublin.&nbsp;1998.
</p>

<p>
<a id="orga002461"></a>Simon Dobson and Paddy Nixon.  <i>(Free) Radical Programming Languages</i>. In <i>Proceedings of the 5th CaberNet Radicals Workshop</i>. Oporto, <span class="caps">PT</span>.&nbsp;1998.
</p>

<p>
<a id="orgca929d2"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/vanilla-caltech-1998.ppt">Fragmenting Languages</a></i>. 1998. Invited talk to the Department of Computer Science, California Institute of&nbsp;Technology.
</p>
</div>
</div>
</div>
	    </div>
	</article>
</div>

	<!-- Social sharing section -->

	<!-- Tag Section -->

	<!-- Post Navigation links -->

    <!-- Page Footer -->
    <section class="footer-sidebar clear" role="complementary"><div class="widget-block">
	    <aside class="widget"><h2 class="widget-title">Simon&nbsp;Dobson</h2>
		<div class="widget-text">Aut tace aut loquere meliora silentio</div>
	    </aside>
</div>
    </section><!-- Extra JavaScript --><!-- Site Attributions --><footer class="site-footer" role="contentinfo"><div class="site-info">
	    <p></p>
	    <p>
	      Built with free and open-source software.
	      Powered by <a href="https://getnikola.com/">Nikola</a> using a theme based on
	      <a href="https://themes.getnikola.com/v7/libretto/">Libretto</a>.
	    </p>
	    <p>
	      All content Copyright © 2010–2024 Simon Dobson and licensed under
	      <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/"><span class="caps">CC</span>-<span class="caps">BY</span>-<span class="caps">NC</span>-<span class="caps">SA</span>-4.0</a>
	      unless otherwise&nbsp;noted.
	    </p>
	</div>
	<div class="social">
	    <ul class="menu"></ul>
</div>
    </footer>
</body>
</html>